fitme/app/controllers/home_controller.rb

  def dashboard
    # Development: Auto-login demo user if not authenticated
    unless user_signed_in?
      demo_user = User.find_or_create_by!(email: 'demo@fitme.com') do |user|
        user.password = 'password123'
        user.password_confirmation = 'password123'
      end
      sign_in(demo_user)
    end

    # Create mock items if none exist (for demo purposes)
    if current_user.items.empty?
      create_mock_items_for_demo
    end

    # Create mock outfit suggestions if none exist (for demo purposes)
    if current_user.outfit_suggestions.empty?
      create_mock_suggestions_for_demo
    end

    @items = current_user.items.order(created_at: :desc).limit(6)
---
SELECT 1 AS one FROM "items" WHERE "items"."user_id" = 1 LIMIT 1
SELECT 1 AS one FROM "outfit_suggestions" WHERE "outfit_suggestions"."user_id" = 1 LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."user_id" = 1 ORDER BY "items"."created_at" DESC LIMIT 6

  def create_mock_items_for_demo
    mock_items = [
      { category: 'top', color: '#FF6B6B', season: 'summer' },
      { category: 'top', color: '#4ECDC4', season: 'spring' },
      { category: 'top', color: '#FFE66D', season: 'fall' },
      { category: 'bottom', color: '#95E1D3', season: 'summer' },
      { category: 'bottom', color: '#1A535C', season: 'winter' },
      { category: 'bottom', color: '#3D5A80', season: 'fall' },
      { category: 'outer', color: '#293241', season: 'winter' },
      { category: 'outer', color: '#EE6C4D', season: 'fall' },
      { category: 'shoes', color: '#000000', season: 'spring' },
      { category: 'shoes', color: '#FFFFFF', season: 'summer' },
      { category: 'top', color: '#98C1D9', season: 'spring' },
      { category: 'outer', color: '#E0FBFC', season: 'spring' }
    ]

    mock_items.each do |item_data|
      current_user.items.create!(item_data)
---
INSERT INTO "items" ("user_id", "category", "color", "season", "meta_data", "created_at", "updated_at") VALUES (1, 'top', '#FF6B6B', 'summer', NULL, '2026-01-31 23:00:50.922117', '2026-01-31 23:00:50.922117') RETURNING "id"

  def create_mock_suggestions_for_demo
    mock_suggestions = [
      {
        suggested_for_date: Date.today,
        weather_snapshot: { temp: 22, feels_like: 20, description: '맑음' }.to_json,
        item_ids: current_user.items.limit(3).pluck(:id)
      },
      {
        suggested_for_date: Date.today - 1.day,
        weather_snapshot: { temp: 18, feels_like: 16, description: '흐림' }.to_json,
        item_ids: current_user.items.limit(3).pluck(:id)
      },
      {
        suggested_for_date: Date.today - 2.days,
        weather_snapshot: { temp: 25, feels_like: 24, description: '화창함' }.to_json,
        item_ids: current_user.items.limit(3).pluck(:id)
      },
      {
        suggested_for_date: Date.today - 3.days,
        weather_snapshot: { temp: 15, feels_like: 13, description: '비' }.to_json,
        item_ids: current_user.items.limit(3).pluck(:id)
      },
      {
        suggested_for_date: Date.today - 4.days,
        weather_snapshot: { temp: 20, feels_like: 19, description: '구름 조금' }.to_json,
        item_ids: current_user.items.limit(3).pluck(:id)
      }
    ]

    mock_suggestions.each do |suggestion_data|
      current_user.outfit_suggestions.create!(suggestion_data)
---
SELECT "items"."id" FROM "items" WHERE "items"."user_id" = 1 LIMIT 3
INSERT INTO "outfit_suggestions" ("user_id", "suggested_for_date", "weather_snapshot", "item_ids", "selected", "created_at", "updated_at") VALUES (1, '2026-02-01', '"{\"temp\":22,\"feels_like\":20,\"description\":\"맑음\"}"', '[1,2,3]', FALSE, '2026-01-31 23:00:50.954018', '2026-01-31 23:00:50.954018') RETURNING "id"