fitme/app/controllers/items_controller.rb

  def index
    @items = current_user.items.order(created_at: :desc)
    @items = @items.where(category: params[:category]) if params[:category].present?
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = 1 ORDER BY "items"."created_at" DESC
SELECT 1 AS one FROM "items" WHERE "items"."user_id" = 1 LIMIT 1

  def ensure_demo_user
    unless user_signed_in?
      demo_user = User.find_or_create_by!(email: 'demo@fitme.com') do |user|
---
INSERT INTO "users" ("email", "role", "created_at", "updated_at", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES ('demo@fitme.com', 0, '2026-01-31 22:57:29.996030', '2026-01-31 22:57:29.996030', '$2a$12$StOdWfBTTsty2CIuZyyvguGaM/kQSUyAr8xCusUJS0q6L.wRpvlr.', NULL, NULL, NULL) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = 'demo@fitme.com' LIMIT 1

  def set_item
    @item = current_user.items.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = 1 AND "items"."id" = 10 LIMIT 1