fitme/app/controllers/outfit_suggestions_controller.rb

  def index
    @suggestions = current_user.outfit_suggestions.order(suggested_for_date: :desc).limit(10)
---
SELECT "outfit_suggestions".* FROM "outfit_suggestions" WHERE "outfit_suggestions"."user_id" = 1 ORDER BY "outfit_suggestions"."suggested_for_date" DESC LIMIT 10

  def show
    @suggestion = current_user.outfit_suggestions.find(params[:id])
---
SELECT "outfit_suggestions".* FROM "outfit_suggestions" WHERE "outfit_suggestions"."user_id" = 1 AND "outfit_suggestions"."id" = 1 LIMIT 1