fitme/app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("user_id", "height_cm", "weight_kg", "measurements", "avatar_3d_file_path", "is_public_api", "created_at", "updated_at", "secure_id") VALUES (1, 175.0, 70.0, NULL, NULL, TRUE, '2026-01-31 22:59:56.248407', '2026-01-31 22:59:56.248407', 'd0760e5d6dae9422ca2d410ffff70754') RETURNING "id"
---
  def set_profile
    @profile = current_user.profile || current_user.create_profile