fitme/app/views/outfit_suggestions/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."id" = 1 LIMIT 1
---
      <% @suggestion.item_ids.each do |item_id| %>
        <% item = Item.find_by(id: item_id) %>